In [1]:
import pandas as pd

In [2]:
car_series = pd.Series(["BMW", "Toyota", "Honda"])

In [3]:
car_series

0       BMW
1    Toyota
2     Honda
dtype: object

In [4]:
colors = pd.Series(["Red", "Blue", "Green"])
colors

0      Red
1     Blue
2    Green
dtype: object

In [5]:
car_data = pd.DataFrame({"Car make": car_series, "Color": colors})

In [6]:
car_data

  Car make  Color
0      BMW    Red
1   Toyota   Blue
2    Honda  Green

In [12]:
cars = pd.read_csv("./data/car-sales.csv")

In [13]:
cars.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [14]:
cars.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [17]:
len(cars)

10

In [20]:
cars.mean(numeric_only=True)

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [21]:
cars.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [23]:
cars.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [24]:
cars.index

RangeIndex(start=0, stop=10, step=1)

In [26]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [27]:
car_prices = pd.Series([3000, 5000, 1890])
car_prices.mean()

np.float64(3296.6666666666665)

In [29]:
cars.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [31]:
cars["Doors"].sum(numeric_only=True)

np.int64(40)

In [32]:
cars.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [34]:
animals = pd.Series(["cat", "dog", "pigeon", "panda", "snake"], index = [0,5,7,8,1])

In [35]:
animals

0       cat
5       dog
7    pigeon
8     panda
1     snake
dtype: object

In [36]:
animals.loc[7]

'pigeon'

In [37]:
animals.iloc[1]

'dog'

In [38]:
cars.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [39]:
animals.iloc[:3]

0       cat
5       dog
7    pigeon
dtype: object

In [41]:
animals.loc[:8]

0       cat
5       dog
7    pigeon
8     panda
dtype: object

In [42]:
cars["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [43]:
cars.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [44]:
cars[cars["Make"] == "Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [45]:
cars[cars["Odometer (KM)"] > 100000]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00

In [18]:
heart_disease = pd.read_csv("https://raw.githubusercontent.com/mrdbourke/zero-to-mastery-ml/master/data/heart-disease.csv")